### Q11. 최대값 - 최소값을 반환하는 사용자 함수를 min_max로 정의하고 age, fare 열로 구성되는 타이타닉 데이터프레임df 에 적용하여 결과와 자료형을 출력하세요. source : titanic = sns.load_dataset('titanic')

In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

titanic = sns.load_dataset('titanic')

In [2]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [3]:
df = titanic[["age","fare"]]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [4]:
def min_max(x):
    print(min(x))
    print(max(x))
df.apply(min_max)

0.42
80.0
0.0
512.3292

age     None
fare    None
dtype: object

### Q12. df 에서 'age' 칼럼과 'fare'칼럼을 더한 가격을 리턴하는 사용자 함수를 정의한 후 df['add'] 변수를 생성하여 출력하세요.(lambda 함수 사용)

In [9]:
def adds(a,b):
    return a+b
df["add"] = df.apply(lambda x:adds(x["age"], x["fare"]), axis = 1)
df.head()

C:\Users\admin\AppData\Local\Temp\ipykernel_12864\221001242.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["add"] = df.apply(lambda x:adds(x["age"], x["fare"]), axis = 1)

    age     fare       add
0  22.0   7.2500   29.2500
1  38.0  71.2833  109.2833
2  26.0   7.9250   33.9250
3  35.0  53.1000   88.1000
4  35.0   8.0500   43.0500

### Q13. 'age', 'fare' 두개 칼럼으로 구성되는 titanic 데이터프레임에서 [0,1]의 값을 NaN을 변경한 후 df 이름으로 출력하세요.

In [11]:
import pandas as pd
import seaborn as sns
import numpy as np

titanic = sns.load_dataset('titanic')

In [12]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [13]:
df = titanic[["age","fare"]]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [14]:
df1 = df.copy()
df1.iloc[0,1] = np.nan
df1.head()

    age     fare
0  22.0      NaN
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [15]:
df1.isnull().sum()

age     177
fare      1
dtype: int64

### Q14. 각 열의 NaN 찾기, 각 열의 NaN 개수 반환, 데이터프레임의 총 NaN 개수를 반환하는 사용자 함수를 정의한 후 df.pipe 메소드로 함수 매핑한 결과를 모두 출력하세요.

In [16]:
def nan(x):
    print(x["age"].isnull())
    print(x["age"].isnull().sum())
    print(x["fare"].isnull())
    print(x["fare"].isnull().sum())
    print(x["age"].isnull().sum()+x["fare"].isnull().sum())
    return x
df1.pipe(nan)

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: age, Length: 891, dtype: bool
177
0       True
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: fare, Length: 891, dtype: bool
1
178

      age     fare
0    22.0      NaN
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

### Q15. 타이타닉 df의 열 순서를 아래와 같이 재구성하고 출력하세요
* 열 선택 : ['pclass', 'sex', 'age', 'survived'].
* 열 이름의 리스트 만들기
* 열 이름을 알파벳 순으로 정렬하기
* 열 이름을 기존 순서의 정반대 역순으로 정렬하기
* 열 이름을 사용자가 정의한 임의의 순서로 재배치하기

In [17]:
df3 = titanic.copy()

In [18]:
df2 = df3[["pclass", "sex", "age", "survived"]]
df2

     pclass     sex   age  survived
0         3    male  22.0         0
1         1  female  38.0         1
2         3  female  26.0         1
3         1  female  35.0         1
4         3    male  35.0         0
..      ...     ...   ...       ...
886       2    male  27.0         0
887       1  female  19.0         1
888       3  female   NaN         0
889       1    male  26.0         1
890       3    male  32.0         0

[891 rows x 4 columns]

In [19]:
liti = list(df2)
liti

['pclass', 'sex', 'age', 'survived']

In [20]:
liti.sort()
liti

['age', 'pclass', 'sex', 'survived']

In [21]:
liti.reverse()
liti

['survived', 'sex', 'pclass', 'age']

In [22]:
df4 = df2[["sex","age","pclass","survived"]]
liti = list(df4)
liti

['sex', 'age', 'pclass', 'survived']

In [23]:
columns = ["sex","age","pclass","survived"]
df_customed = df3[columns]
df_customed.head()

      sex   age  pclass  survived
0    male  22.0       3         0
1  female  38.0       1         1
2  female  26.0       3         1
3  female  35.0       1         1
4    male  35.0       3         0